m = [
    ["Пицца Маргарита", ["мука", "томаты", "сыр", "базилик"], 10],
    ["Салат Цезарь", ["салат", "курица", "сыр", "сухарики"], 8],
    ["Суп Томатный", ["томаты", "лук", "морковь", "картофель"], 6]
]
p = m[0][0]
s = m[1][0]
t = m[2][0]
print(f"Вот наше меню:\n{p}\n{s}\n{t}\n\nИнгредиенты какого блюда хотите узнать и цену? Или же изменить цену?")
r = input("Узнать ингредиенты или же изменить цену?\n")
if r == "Изменить" or r == "изменить":
    b = input("Блюдо:")
    c = input("Цена:")
    if b == p:
        m[0][2] = c
        print("Новая цена:", m[0][2])
    elif b == s:
        m[1][2] = c
        print("Новая цена:", m[1][2])
    elif b == t:
        m[2][2] = c
        print("Новая цена:", m[2][2])

if r == "Узнать" or r == "узнать":
    b = input("Блюдо:")
    if b == p:
        print("Пожалуйста, ингредиенты с ценой:", m[0][1][0], m[0][1][1], m[0][1][2], m[0][1][3])
        print(m[0][2])
    elif b == s:
        print("Пожалуйста, ингредиенты с ценой:", m[1][1][0], m[1][1][1], m[1][1][2], m[1][1][3])
        print(m[1][2])
    elif b == t:
        print("Пожалуйста, ингредиенты с ценой:", m[2][1][0], m[2][1][1], m[2][1][2], m[2][1][3])
        print(m[2][2])
